---
tags:
  - Практика
  - ЯзыкПрограммирования
  - Python
---
### Задание 3

Пусть дан список-матрица, который содержит три списка:

```python
mat = [
    [10, 20, 30],
    [40, 50, 60],
    [70, 80, 80]
]
```

Выведите элементы матрицы с помощью циклов, чтобы получился консольный вывод как в следующем примере:

**Пример 1:**

```
10 20 30
40 50 60
70 80 90
```

%%
```python
mat = [
    [10, 20, 30],
    [40, 50, 60],
    [70, 80, 90]
]
# вывод матрицы с помощью цикла
for i in range(3):
    for j in range(3):
        print(mat[i][j], end = " ")
    print() # перевод на другую строку
```
%%

---
### Задание 4

Напишите программу, которая удаляет дубликаты из списка.

**Пример 1:**

```
Начальный список:  [10, 20, 10, 20, 30, 40, 30, 50]
После удаления дублей:  [10, 20, 30, 40, 50]
```

%%
```python
list1 = [10, 20, 10, 20, 30, 40, 30, 50]
# список, который будет содержать уникальные элементы
list2 = []
# перебираем все элементы первого списка
for n in list1:
    if n not in list2:
        list2.append(n)
 
 
print ("Начальный список: ", list1)
print ("После удаления дублей: ", list2)
```
%%

---