---
tags:
  - Практика
  - ЯзыкПрограммирования
  - Python
---
### Задание 7 

Напишите программу, которая удаляет из списка чисел четные числа.

**Пример 1:**

```
Начальный список:  [11, 22, 33, 44, 55]
Список с нечетными числами:  [11, 33, 55]
```

%%
```python
# исходный список
list = [11, 22, 33, 44, 55]
print ("Начальный список: ", list)
 
# в цикле перебираем элементы и удаляем те, которые деляться на 2 без остатка
for i in list:
    if(i%2 == 0):
        list.remove(i)
         
print ("Список с нечетными числами: ", list)
```
%%

---
### Задание 8

Напишите функцию, которая принимает два списка и возвращает новый список, в котором каждый элемент представляет сумму соответствующих элементов обоих списков.

**Пример 1:**

```
Первый список:  [1, 2, 3, 4]
Второй список:  [5, 6, 7, 8]
Результат сложения:  [6, 8, 10, 12]
```

%%
```python
def add_two_lists(a, b):
    c = []      # список, где каждый элемент представляет сумму соответствующих элементов списков
    for n, m in zip(a, b):
        c.append(n + m)
    return c
 
list1 = [1, 2, 3, 4]
list2 = [5, 6, 7, 8]
list3 = add_two_lists(list1, list2)
 
print("Первый список: ", list1)
print("Второй список: ", list2)
print("Результат сложения: ", list3)
```
%%

---