---
tags:
  - Практика
  - ЯзыкПрограммирования
  - Python
---
### Задание 5

Напишите программу, которая с помощью цикла создает список чисел от 1 до 10, а также списки их квадратов и кубов. В конце списки выводятся на консоль.

**Пример 1:**

```python
numbers:  [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
squares:  [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]
cubes :  [1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]
```

%%
```python
# списки чисел
numbers = []
squares = []
cubes = []
# начальное и конечное значения диапазона
start = 1
end = 10
# цикл добавления чисел в список
for count in range (start, end+1) :
    numbers.append (count)
    squares.append (count**2)
    cubes.append (count**3)
 
 
print ("numbers: ",numbers)
print ("squares: ",squares)
print ("cubes : ",cubes)
```
%%

---
### Задание 6

Напишите программу, которая располагает элементы списка в обратном порядке.

**Пример 1:**

```
Начальный список:  [10, 20, 30, 40, 50]
Список в обратном порядке:  [50, 40, 30, 20, 10]
```

%%
```python
# определяем список
list1 = [10, 20, 30, 40, 50]
print ("Начальный список: ", list1)
 
# обращаем список в обратном порядке
list1 = list1[::-1]
print ("Список в обратном порядке: ", list1)
```
%%

---