# Напишите код, где функция будет запрашивать у
# пользователя электронную почту и информировать, что на эту
# (введенная пользователем информация)
# почту будет направлено письмо с приглашением.

q = input("введи почту")
print(f"на эту {q} почту будет направлено письмо с приглашением")

input()