# Создайте список с названиями языков программирования
# (Python, C++, C#, Fortran, JavaScript).
# Используйте цикл for, для того, чтобы программа вывела их на экран.

A = ["Python", "C++", "C#", "Fortran", "JavaScript"]
for A in A :
    print(A)

input()