# Введите в интерпретатор информацию ниже.
# Выведите на экран список my_darling_list
# my_darling_list.insert(0, 300)
# my_darling_list.sort()

my_darling_list = [2, 23, 44, 400]
my_darling_list.insert(0, 300)
my_darling_list.sort()

print(my_darling_list)

input()